{
  "sectionTitle": "Projects",
  "sectionSubtitle": "Professional Key Deliverables",
  "projects": [
    {
      "id": 1,
      "icon": "uil-brain",
      "title": "AI Reconciliation Assistant",
      "modalTitle": "AI-Powered Reconciliation Assistant",
      "descriptionBulletin": [
        "Architected a scalable, standalone AI assistant using React/Next.js, ensuring loose coupling with the core ERP system.",
        "Led the frontend implementation of real-time streaming using SignalR, ensuring high-performance data delivery with strict user isolation.",
        "Defined technical specifications and collaborated with backend architects to design secure API contracts.",
        "Mentored junior developers on handling asynchronous state complex streaming data management."
      ]
    },
    {
      "id": 2,
      "icon": "uil-money-withdrawal",
      "title": "ERP-PSP Reconciliation",
      "modalTitle": "ERP-PSP Financial Reconciliation Platform",
      "descriptionBulletin": [
        "Led the frontend architecture for the Financial Reconciliation module, supporting complex manual and automated workflows.",
        "Managed the frontend sprint cycles, including task estimation, assignment, and code reviews to ensure delivery quality.",
        "Re-architected the legacy loading strategy using module federation concepts, significantly improving application start time.",
        "Acted as the primary point of contact for product owners, translating business requirements into technical frontend tasks."
      ]
    },
    {
      "id": 3,
      "icon": "uil-shield-check",
      "title": "B2B RBAC Dashboard",
      "modalTitle": "B2B Dashboard with Hierarchical RBAC",
      "descriptionBulletin": [
        "Designed and implemented a generic, hierarchical Role-Based Access Control (RBAC) system for B2B dashboards.",
        "Established coding standards and best practices for the team, resulting in a more maintainable and consistent codebase.",
        "Led the refactoring of core UI libraries to reduce technical debt and improve component reusability across multiple projects.",
        "Conducted daily stand-ups and participated in sprint retro to drive continuous process improvement."
      ]
    },
    {
      "id": 4,
      "icon": "uil-shopping-cart",
      "title": "D365 E-Commerce",
      "modalTitle": "Microsoft D365 B2B E-Commerce Customization",
      "descriptionBulletin": [
        "Took ownership of the frontend delivery for the D365 E-Commerce platform, customizing the React SDK to meet specific B2B needs.",
        "Collaborated closely with cross-functional teams to integrate disparate systems (Finance, AI, Commerce) into a unified user experience.",
        "Provided technical mentorship to team members on the D365 architecture and React best practices."
      ]
    },
    {
      "id": 5,
      "icon": "uil-layer-group",
      "title": "System Architecture",
      "modalTitle": "Frontend Architecture & Optimization",
      "descriptionBulletin": [
        "Spearheaded the performance optimization initiative, re-architecting legacy code to improve Core Web Vitals.",
        "Introduced and enforced strict code review processes and automated testing strategies to maintain high code quality.",
        "Allocated tasks to the frontend team based on skill sets and project priorities, ensuring efficient resource utilization.",
        "Facilitated technical workshops to upskill the team on modern React patterns and performance optimization techniques."
      ]
    }
  ]
}
