{
  "sectionTitle": "Projects",
  "sectionSubtitle": "Professional Key Deliverables",
  "projects": [
    {
      "id": 1,
      "icon": "uil-brain",
      "title": "AI Reconciliation Assistant",
      "modalTitle": "AI-Powered Reconciliation Assistant (BASOFA)",
      "descriptionBulletin": [
        "Built an AI-powered reconciliation assistant as a standalone React/Next.js capability with asynchronous initialization.",
        "Implemented real-time, user-specific AI response streaming using SignalR (pub/sub), ensuring strict data isolation per user.",
        "Designed the integration to be seamless within the larger ERP ecosystem, enhancing user decision-making processes."
      ],
      "link": "#"
    },
    {
      "id": 2,
      "icon": "uil-money-withdrawal",
      "title": "ERP-PSP Reconciliation",
      "modalTitle": "ERP-PSP Financial Reconciliation Platform",
      "descriptionBulletin": [
        "Architected frontend business flows for ERP-PSP financial reconciliation, supporting manual and automated rule-driven workflows.",
        "Designed reconciliation as the primary execution flow and re-architected legacy React/Next.js loading using module isolation and deferring non-critical features.",
        "Coordinated frontend work for the project, including sprint planning and task assignments."
      ],
      "link": "#"
    },
    {
      "id": 3,
      "icon": "uil-shield-check",
      "title": "B2B RBAC Dashboard",
      "modalTitle": "B2B Dashboard with Hierarchical RBAC",
      "descriptionBulletin": [
        "Built a React/Next.js B2B application with hierarchical user roles, permissions, and data-driven dashboards.",
        "Implementation ensured secure access control while maintaining a flexible and user-friendly interface for different organizational levels.",
        "Delivered production-critical performance and stability fixes in legacy-heavy frontend systems."
      ],
      "link": "#"
    },
    {
      "id": 4,
      "icon": "uil-shopping-cart",
      "title": "D365 E-Commerce",
      "modalTitle": "Microsoft D365 B2B E-Commerce Customization",
      "descriptionBulletin": [
        "Developed custom B2B functionality on Microsoft D365 E-Commerce leveraging the React SDK, Site-builder and platform APIs.",
        "Took ownership of frontend architecture and delivery across finance, AI, and commerce projects.",
        "Worked closely with backend and product teams to ensure seamless integration of custom modules."
      ],
      "link": "#"
    },
    {
      "id": 5,
      "icon": "uil-layer-group",
      "title": "Legacy Optimization",
      "modalTitle": "System Optimization & Architecture",
      "descriptionBulletin": [
        "Re-architected legacy React/Next.js loading mechanisms using module isolation, significantly improving initial load times.",
        "Refactored core UI layers and upgraded dependencies to improve maintainability and reduce technical debt.",
        "Built real-time, data-driven interfaces and supported teams through mentoring and technical guidance."
      ],
      "link": "#"
    }
  ]
}
